# -*- coding: utf-8 -*-
"""
Created on Fri Nov  6 16:05:00 2020

Условие:
Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

@author: 1
"""

A = int(input("Введите трехзначное число "))

Sum = A % 10
Mlt = A % 10
A2 = A // 10

Sum = Sum + (A2 % 10)
Mlt = Mlt * (A2 % 10)
A3 = A2 // 10

Sum = Sum + A3
Mlt = Mlt * A3

print(f"Сумма цифр введенно числа равна {Sum}, а произведение - {Mlt}")